#include <iostream>

/* Указателят this
    Във всеки метод на класа, ключовата дума this е константен указател,
    който държи адреса на текущия обект, върху който работим.

    this може да е много полезен, когато искаме да имаме променливи в метод или аргументи на метод, които да
    използват същото име като това на някой член на класа, защото ще ни даде възможност да различим
    локалната променлива от член-данната.
*/

class Simple {
public:
    int value{ 15 };

    void changeValue(int value);
};

int main() {
    Simple p;

    /*
        Когато извикваме методите на класа, this се подава неявно.
        Компилаторът добавя указателя this към аргументите на методите.
    */
    p.changeValue(25); // Компилаторът превръща този ред в: Simple::changeValue(&p, 25);

    return 0;
}

void Simple::changeValue(int value) {
    // value = value; // Този ред е грешен, защото не е ясно, какво се опитваме да променим.
    this->value = value; // Този ред е коректен, защото е ясно, че искаме да променим член-данната value на обекта, върху който работим.
}
